In [3]:
import pandas as pd

import numpy as np

from pandas import Series, DataFrame

from numpy.random import randn

In [6]:
ser1 = Series ([1,2,3,4], index = ['A', 'B', 'C', 'D'])

ser1

A    1
B    2
C    3
D    4
dtype: int64

In [7]:
#reindex
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [8]:
#fill added empty valuewith a 0, e & F stay nul as they existed in the previous index

ser2.reindex(['A','B','C','D','E','F','G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [15]:
ser3 = Series(['USA', 'Mixico', 'Canada'], index = [0,5,10])
ser3

0        USA
5     Mixico
10    Canada
dtype: object

In [16]:
#reindex from 0 to 14

ranger = range(15)
ranger

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [17]:
#reindex by using method, forwarfd fill
#from 0 to 4 fills USA from 5 to 9 fills mexico and from 10 to 14 fills Canada
ser3.reindex(ranger, method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mixico
6     Mixico
7     Mixico
8     Mixico
9     Mixico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [18]:
#reindex rows or columns
#ran 25 gets a list, reshape indicates matrix 5x5
dframe = DataFrame(randn(25).reshape((5,5)), index = ['A','B','D','E','F'], columns = ['col1', 'col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A  1.543700  0.556904  0.060915  0.834538 -0.373543
B -0.604893  1.302231 -1.376478  0.909049 -0.824801
D -1.687419 -0.063674 -0.473259 -0.629689  0.369097
E -0.606867 -0.188273  1.076136  1.194199 -0.890427
F -0.361036  0.878041  0.544194  1.811204  0.270901

In [19]:
#reindex with c

dframe2 = dframe.reindex(['A','B','C','D','E','F'])
dframe2

       col1      col2      col3      col4      col5
A  1.543700  0.556904  0.060915  0.834538 -0.373543
B -0.604893  1.302231 -1.376478  0.909049 -0.824801
C       NaN       NaN       NaN       NaN       NaN
D -1.687419 -0.063674 -0.473259 -0.629689  0.369097
E -0.606867 -0.188273  1.076136  1.194199 -0.890427
F -0.361036  0.878041  0.544194  1.811204  0.270901

In [20]:
#reindex columns

new_columns = ['col1', 'col2','col3','col4','col5','col6']

dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A  1.543700  0.556904  0.060915  0.834538 -0.373543   NaN
B -0.604893  1.302231 -1.376478  0.909049 -0.824801   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.687419 -0.063674 -0.473259 -0.629689  0.369097   NaN
E -0.606867 -0.188273  1.076136  1.194199 -0.890427   NaN
F -0.361036  0.878041  0.544194  1.811204  0.270901   NaN

In [21]:
dframe

       col1      col2      col3      col4      col5
A  1.543700  0.556904  0.060915  0.834538 -0.373543
B -0.604893  1.302231 -1.376478  0.909049 -0.824801
D -1.687419 -0.063674 -0.473259 -0.629689  0.369097
E -0.606867 -0.188273  1.076136  1.194199 -0.890427
F -0.361036  0.878041  0.544194  1.811204  0.270901

In [24]:
#reindex with lox
dframe.loc[['A','B','C','D','E','F'], new_columns]

       col1      col2      col3      col4      col5  col6
A  1.543700  0.556904  0.060915  0.834538 -0.373543   NaN
B -0.604893  1.302231 -1.376478  0.909049 -0.824801   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.687419 -0.063674 -0.473259 -0.629689  0.369097   NaN
E -0.606867 -0.188273  1.076136  1.194199 -0.890427   NaN
F -0.361036  0.878041  0.544194  1.811204  0.270901   NaN